NNATENDS = ['шык', 'шы', 'пыр', 'мпыр', 'алар', 'ашыщ', 'лар', 'елер', 'ды', 'рдан', 'рлан', 'рсақ', 'қтар', 'ылар', 'ылык', 'нші', 'лік', 'сшы', 'пша', 'хана', 'ашы', 'ші', 'паз', 'лық', 'йлар', 'қсы', 'ылық', 'ндық', 'ім', 'ар', 'ас', 'кер', 'уші', 'шілер', 'рік', 'ктер', 'қша', 'пан', 'лшы', 'дыр', 'тыр', 'рған', 'қай', 'алар', 'ылар', 'ңғы', 'ылар', 'ырақ', 'тік', 'ңдар', 'лын', 'ншақ', 'най', 'қтар', 'гер', 'рлер', 'ылар', 'ңіз', 'зші', 'шлер', 'гер', 'рлер', 'пкер', 'рлер', 'лігі', 'тур', 'турлер', 'ші', 'ілер', 'ншық', 'ын', 'шілік', 'ылық', 'дар', 'лық', 'ылар', 'шы', 'тар', 'гер', 'герлер', 'лер', 'ханалар', 'ілеп', 'паз', 'ік', 'іктер', 'керткіш', 'ту', 'ірткі', 'еп', 'ептер', 'сіз', 'уас', 'керу', 'ім', 'імде', 'башы', 'елер', 'пенділер', 'бек', 'кқор', 'шіл', 'ктер', 'ағасы', 'сы', 'лар', 'улар', 'тау']
NNILENDS = ['мның', 'енің', 'рдың', 'дың']
NNBAENDS = ['да', 'те', 'та', 'нда', 'нде', 'ға', 'ге', 'қа', 'ке', 'на', 'не', 'а', 'е', 'тік', 'еге  ырға', 'рға', 'йға', 'ыға', 'аға', 'шаға', 'сіз', 'мға', 'ға']
NNTAENDS = ['мды', 'ені', 'рды', 'ырды', 'тты', 'ңды', 'керту', 'қы']
NNDJAENDS = ['да', 'зға', 'рда', 'еде']
NNSHIENDS = ['дан', 'ден', 'тан', 'тен', 'нан', 'нен', 'здан', 'зда', 'еден', 'рдан']
NNKOENDS = ['бен', 'здар', 'ммен', 'емен', 'рдан', 'мен', 'лармен', 'пен', 'нен', 'рмен', 'тпен', 'ңге', 'менен', 'ммен', 'мен', 'тармен', 'ілермен', 'герлермен', 'басшылық', 'іпқону', 'пенен']


SUB_ONE_SUF = ('тар', 'тер', 'дар', 'дер', 'лар', 'лер')

SUB_PLURAL_SUFFS = ('ның', 'нің', 'дың', 'дін', 'тың', 'тің',
                    'ға', 'ге', 'қа', 'ке', 'а', 'е', 'на', 'не',
                    'ны', 'н', 'ні', 'ды', 'ді', 'ты', 'ті',
                    'да', 'де', 'нда', 'нде', 'та', 'те',
                    'дан', ' ден', ' тан', ' тен', ' нан', ' нен',
                    'мен', ' менен', ' бен', ' бенен', ' пен', ' пенен')
SUB_SUFFIXES = ('ғай', 'гей', 'гер', 'ғи', 'ғой', 'дас', 'дес', 'дік', 'дық', 'кер', 'кес', 'қай', 'қар', 'қи', 'қой', 'қор', 'лас', 'лес', 'ліқ', 'лық', 'ман', 'паз', 'пана', 'сақ', 'тас', 'тес', 'тік', 'тық', 'хана', 'ша', 'шақ', 'ше', 'шек', 'ші', 'шік', 'шы', 'шық', 'ақ', 'ба', 'бе', 'ғақ', 'ғаш', 'гек', 'гі', 'ғіш', 'ғы', 'ғыш', 'дақ', 'дек', 'ек', 'ік', 'ім', 'іс', 'іш', 'к', 'кі', 'кіш', 'қ', 'қаш', 'қы', 'қыш', 'лақ', 'лек', 'м', 'ма', 'мақ', 'ме', 'мек', 'па', 'пақ', 'пе', 'пек', 'с', 'тақ', 'тек', 'уік', 'уық', 'ш', 'ық', 'ым', 'ыс', 'ыш', 'герлік', 'гіштік', 'ғыштық', 'дастық', 'дестік', 'ділік', 'дылық', 'кеәтік', 'қорлық', 'ластық', 'лестік', 'лілік', 'лылық', 'паздық', 'сақтық', 'сіздік', 'сыздық', 'тастық', 'тестік', 'тілік', 'тылық', 'шақтық', 'шілдік', 'шілік', 'шылдық', 'шылық', 'жан', 'ке', 'қан', 'сымақ', 'тай', 'ш', 'ша', 'шақ', 'ше', 'шік', 'шық')
SUB_ONE_l1 = ['а', 'у', 'н']
SUB_ONE_l2 = ['ға', 'ге', 'қа', 'ке', 'на', 'не', 'ны', 'ні', 'ды', 'ді', 'ты', 'ті', 'да', 'де', 'та', 'те', ]
SUB_ONE_l3 = ['ның', 'нің', 'дың', 'дін', 'тың', 'тің', 'нда', 'нде', 'дан', 'ден', 'тан', 'тен', 'нан', 'нен', 'мен', 'бен', 'пен']
SUB_ONE_l5 = ['менен', 'бенен', 'пенен']

OBJ_SUFFIXES = ('ға', 'ге', 'қа', 'ке', 'а', 'е', 'на', 'не', 'ны', 'н', 'ні', 'ды', 'ді', 'ты', 'ті')
OBJ_ENDS = ('тар', 'тер', 'дар', 'дер', 'лар', 'лер')

PRED_A_STARTS = ('тұр', 'отыр', 'жатыр', 'жүр')
PRED_A_SUFFIXES = ('біз', 'бін', 'быз', 'бын', 'ды', 'міз', 'мін', 'мыз', 'мын', 'піз', 'пің', 'пыз', 'пын', 'сіз', 'сіздер', 'сіндер', 'сің', 'сыз', 'сыздар', 'сың', 'сыңдар', 'ті', 'ты')
PRED_A_ENDS = ('п', 'ып', 'іп')

PRED_B_SUFFIXES = ('ap', 'ер', 'ыр', 'ір', 'а', 'е', 'й', 'и')
PRED_B_SUFFIX_ENDS = ('біз', 'бін', 'быз', 'бын', 'ды', 'міз', 'мін', 'мыз', 'мын', 'піз', 'пің', 'пыз', 'пын', 'сіз', 'сіздер', 'сіндер', 'сің', 'сыз', 'сыздар', 'сың', 'сыңдар', 'ті', 'ты')

PRED_C_SUFFIXES = ('ap', 'ep', 'ыр', 'ір')
PRED_C_POSS_SUFFIXES = ('', 'біз', 'бін', 'быз', 'бын', 'ды', 'міз', 'мін', 'мыз', 'мын', 'піз', 'пің', 'пыз', 'пын', 'сіз', 'сіздер', 'сіндер', 'сің', 'сыз', 'сыздар', 'сың', 'сыңдар', 'ті', 'ты')
PRED_C_ADD = ('еді', 'е')

PRED_D_ADD = ('еді', 'екен')
PRED_D_POSS_SUFFIXES = ('біз', 'бін', 'быз', 'бын', 'ды', 'міз', 'мін', 'мыз', 'мын', 'піз', 'пің', 'пыз', 'пын', 'сіз', 'сіздер', 'сіндер', 'сің', 'сыз', 'сыздар', 'сың', 'сыңдар', 'ті', 'ты')
PRED_D_SUFFIXES = ('ді', 'дік', 'діқ', 'дім', 'дің', 'ды', 'дык', 'дық', 'дым', 'дың', 'қ', 'ті', 'тік', 'тім', 'тің', 'ты', 'тык', 'тық', 'тым', 'тың', 'а', 'ай', 'ал', 'ан', 'ар', 'арыс', 'ға', 'ғал', 'ғар', 'ғе', 'ге', 'гер', 'гі', 'гіз', 'гіздір', 'гіле', 'гір', 'гіт', 'ғы', 'ғыз', 'ғыздыр', 'ғызыл', 'ғыла', 'ғыр', 'ғыт', 'да', 'дан', 'дар', 'дас', 'дастыр', 'де', 'ден', 'дендір', 'дес', 'діг', 'дік', 'дір', 'діргіз', 'дық', 'дыр', 'дырғыз', 'дырыл', 'е', 'ей', 'ел', 'ен', 'ер', 'й', 'іг', 'іғ', 'ік', 'ікіс', 'іл', 'іла', 'ілде', 'ілу', 'імсіре', 'ін', 'індір', 'ініс', 'іну', 'іңкіре', 'ір', 'ірде', 'іре', 'ірей', 'іріс', 'ірке', 'іркен', 'ірқе', 'іс', 'ісу', 'іт', 'ке', 'кер', 'кіз', 'кіле', 'кір', 'қа', 'қал', 'қан', 'қар', 'қе', 'қур', 'қыз', 'қыла', 'қыла', 'қыр', 'л', 'ла', 'лан', 'ландыр', 'лас', 'ластыр', 'лат', 'ле', 'лен', 'лендір', 'лес', 'лестір', 'лет', 'ліг', 'лік', 'лікіс', 'лін', 'ліс', 'лқа', 'лу', 'лығ', 'лық', 'лын', 'лыс', 'мала', 'меле', 'мсіре', 'мсыра', 'н', 'ні', 'ніл', 'ніс', 'ныл', 'ныс', 'ңгіре', 'ңғыра', 'ңкіре', 'ңқыра', 'ңра', 'ңре', 'р', 'ра', 'ре', 'с', 'са', 'сан', 'се', 'сен', 'сет', 'сетіл', 'сі', 'сін', 'сіре', 'стір', 'стыр', 'сы', 'сын', 'сыра', 'т', 'та', 'тан', 'тандыр', 'тас', 'те', 'тен', 'тендір', 'тес', 'тік', 'ттыр', 'тығ', 'тығс', 'тығыс', 'тық', 'тыр', 'тырыл', 'ура', 'ші', 'шы', 'ығ', 'ығыс', 'ық', 'ықыс', 'ыл', 'ыла', 'ылда', 'ылу', 'ылыс', 'ымсыра', 'ын', 'ындыр', 'ыну', 'ыныс', 'ыр', 'ыра', 'ырай', 'ырқа', 'ырқан', 'ырла', 'ыс', 'ысу', 'ыт', 'азы', 'ақта', 'ал', 'ала', 'аңғыра', 'аура', 'бала', 'бе', 'беле', 'би', 'бі', 'бы', 'дала', 'ди', 'ді', 'ды', 'екте', 'ел', 'еңгіре', 'еуре', 'жи', 'жіре', 'жыра', 'зы', 'і', 'ін', 'ірей', 'іс', 'іт', 'қи', 'лі', 'лы', 'ма', 'мала', 'меле', 'ми', 'мсіре', 'мсыра', 'ңра', 'ңре', 'палапеле', 'пи', 'пі', 'пы', 'ра', 'ре', 'си', 'сіре', 'сый', 'сыра', 'т', 'ти', 'ті', 'ты', 'усіре', 'усыра', 'ши', 'ші', 'шы', 'ы', 'ын', 'ыра', 'ырай', 'ыс', 'ыт')

PRED_SUFFIXES = ('ді', 'дік', 'діқ', 'дім', 'дің', 'ды', 'дык', 'дық', 'дым', 'дың', 'қ', 'ті', 'тік', 'тім', 'тің', 'ты', 'тык', 'тық', 'тым', 'тың', 'а', 'ай', 'ал', 'ан', 'ар', 'арыс', 'ға', 'ғал', 'ғар', 'ғе', 'ге', 'гер', 'гі', 'гіз', 'гіздір', 'гіле', 'гір', 'гіт', 'ғы', 'ғыз', 'ғыздыр', 'ғызыл', 'ғыла', 'ғыр', 'ғыт', 'да', 'дан', 'дар', 'дас', 'дастыр', 'де', 'ден', 'дендір', 'дес', 'діг', 'дік', 'дір', 'діргіз', 'дық', 'дыр', 'дырғыз', 'дырыл', 'е', 'ей', 'ел', 'ен', 'ер', 'й', 'іг', 'іғ', 'ік', 'ікіс', 'іл', 'іла', 'ілде', 'ілу', 'імсіре', 'ін', 'індір', 'ініс', 'іну', 'іңкіре', 'ір', 'ірде', 'іре', 'ірей', 'іріс', 'ірке', 'іркен', 'ірқе', 'іс', 'ісу', 'іт', 'ке', 'кер', 'кіз', 'кіле', 'кір', 'қа', 'қал', 'қан', 'қар', 'қе', 'қур', 'қыз', 'қыла', 'қыла', 'қыр', 'л', 'ла', 'лан', 'ландыр', 'лас', 'ластыр', 'лат', 'ле', 'лен', 'лендір', 'лес', 'лестір', 'лет', 'ліг', 'лік', 'лікіс', 'лін', 'ліс', 'лқа', 'лу', 'лығ', 'лық', 'лын', 'лыс', 'мала', 'меле', 'мсіре', 'мсыра', 'н', 'ні', 'ніл', 'ніс', 'ныл', 'ныс', 'ңгіре', 'ңғыра', 'ңкіре', 'ңқыра', 'ңра', 'ңре', 'р', 'ра', 'ре', 'с', 'са', 'сан', 'се', 'сен', 'сет', 'сетіл', 'сі', 'сін', 'сіре', 'стір', 'стыр', 'сы', 'сын', 'сыра', 'т', 'та', 'тан', 'тандыр', 'тас', 'те', 'тен', 'тендір', 'тес', 'тік', 'ттыр', 'тығ', 'тығс', 'тығыс', 'тық', 'тыр', 'тырыл', 'ура', 'ші', 'шы', 'ығ', 'ығыс', 'ық', 'ықыс', 'ыл', 'ыла', 'ылда', 'ылу', 'ылыс', 'ымсыра', 'ын', 'ындыр', 'ыну', 'ыныс', 'ыр', 'ыра', 'ырай', 'ырқа', 'ырқан', 'ырла', 'ыс', 'ысу', 'ыт', 'азы', 'ақта', 'ал', 'ала', 'аңғыра', 'аура', 'бала', 'бе', 'беле', 'би', 'бі', 'бы', 'дала', 'ди', 'ді', 'ды', 'екте', 'ел', 'еңгіре', 'еуре', 'жи', 'жіре', 'жыра', 'зы', 'і', 'ін', 'ірей', 'іс', 'іт', 'қи', 'лі', 'лы', 'ма', 'мала', 'меле', 'ми', 'мсіре', 'мсыра', 'ңра', 'ңре', 'палапеле', 'пи', 'пі', 'пы', 'ра', 'ре', 'си', 'сіре', 'сый', 'сыра', 'т', 'ти', 'ті', 'ты', 'усіре', 'усыра', 'ши', 'ші', 'шы', 'ы', 'ын', 'ыра', 'ырай', 'ыс', 'ыт', 'ған', 'ген', 'қан', 'кен', 'қон', 'ға', 'ге', 'қа', 'ке', 'атын', 'етін', 'йтын', 'йтін')
